import { BoardItem } from "../components/Board/types";

const noticeBoard: BoardItem[] = [
  {
    id: "4",
    category: "NOTICE",
    title: "[틈틈] 서비스 종료 및 환불 안내",
    date: "2026-09-13",
    content: `에이전트 여러분 안녕하세요.
(주)아이리스랩의 대표, 아이리스입니다.

사업을 시작하기 전부터 지금 이 시간까지도 많은 고민을 해 왔습니다.

고소와 소송을 비롯한 법적 절차를 병행하며 서비스를 개시 및 진행하고자 했고,
충분히 감수 가능한 정도의 위험을 감수하고 서비스를 재개하고자 하였습니다.
그것이 제가 생각하는 사업이니까요.

하지만 그렇게 하고 나니
정작 대표인 제가 납득할 수 있는 수준의 서비스를 제공할 수 있는 방법은 존재하지 않았습니다.

그렇기에 (주)아이리스랩은 틈틈의 서비스를 종료, 개인정보 삭제 및 실버 크레딧 환불을 진행합니다.

또한, 서비스 중단 시점 이전 에이전트께서 보유하고 계신 ‘실버 크레딧’의 환불 역시 동시에 진행하고자 합니다.
신청 방법 및 진행 일자는 하기 내용을 참고하여 주시기 바랍니다.

## [진행 일자]

### ‘실버 크레딧’ 환불 신청
2026. 09. 14(월) 00:00 ~ 2026. 09. 30(수) 23:59 (17일간)
- 하단의 [실버 크레딧 환불 신청] 링크를 통해 환불 신청을 할 수 있습니다.

### 환불 완료 및 개인정보 삭제 일시
2026. 10. 14(수)
- 해당 시점부터 당사의 데이터베이스에 등록된 개인정보를 전부 삭제할 예정입니다.
- 단, 법률상 의무 보관해야 하는 정보(전자상거래법에 따른 계약 또는 청약철회에 대한 기록 등)는 해당 법률에 명시된 기간 동안 별도의 데이터베이스에 분리 보관할 예정입니다.

추가적인 문의 사항이 있을 경우 contact@irislab.co.kr로 부탁드립니다. (전화 수신 불가)

한 번만 더 꿈을 꾸고 싶었다고 말한 과거의 저에게
꿈은 이루었지만, 아무것도 남은 건 없었다고 말하고 싶네요.

자세한 내용이 궁금하시다면 하단 [잡담]을 참고해주시면 감사하겠습니다.

감사하고, 죄송했습니다.

2026. 09. 13

[실버 크레딧 환불 신청]
https://forms.gle/hpNYBRCVKayubd468

## [잡담]

### 1. 그래서 왜 종료하냐구요?

사실 계속 운영해도 됩니다!

서버도 막아뒀을 뿐 멀쩡하게 살아있었고,
추가 기능인 본인확인 서비스도 준비가 완료가 된 상태였고, 회원정보 통합관리 및 각종 신규 시스템도 준비를 하고 있던 상태였어요.

그런데요, 아무리 생각해 봐도 저는 이런 걸 담을 그릇은 아닌 것 같더라구요.

가장 컸던 건,
법이라는 것은 사회적 질서를 유지하기 위한 가장 마지막 보루라고 생각합니다.
그런데, 저의 능력 선에서는 이 법에 저를 맞출 수가 없었네요.
제가 법을 잘 아는 것도 아니구요.

그래서 가능한 모든 경우의 수를 살펴봤을 때,
999명을 만족시켜도 1명이 불만을 가지는 것을 제가 납득을 할 수가 없었어요.

### 2. 그럼 사라지는 건가요…?

아니요!

개발은 제가 하려고 했던 거 다 할 겁니다
그냥 앞으로 ‘서비스만’ 종료한다는 거에요.

앞으로 뭐 할지는 https://tumtum.kr -> 여기 앱 소개 페이지 참고해 주시면 됩니다
저런 기능을 추가해 보려고 해요!

앞서 말씀드렸던 서비스를 종료하는 이유가 다 ‘운영’의 측면이어가지고
‘개발’ 에는 아무런 문제가 없더라구요.

버튜버 활동도 계속할 생각입니다.
오늘 치지직 85일차인데, 앞으로도 시간 될 때 놀러오시구요 ㅎ

따라서 당장 아예 모든 걸 접는 게 아닌 ‘개인정보’ 만 삭제하는 것이기 때문에
틈틈과 관련된 지식재산권, 소스코드 등의 권리는 (주)아이리스랩에 기존과 같이 그대로 귀속됩니다.

### 3. 그럼 왜 만드나요?

그러게요 저도 저를 모르겠어요 ㅋㅋ
사실 당연히 서비스를 종료하면 개발도 그만하는 게 상식적이니까요

하지만 저는 그렇게 상식적인 사람이 아닌 거 같아서요
뭔가 시작했으면 일단 끝을 봐야 하더라구요….?

뭐 다양한 방식으로 향후 계획을 생각하고 있기는 한데, 그냥 희망사항일 뿐이니
확정이 된다면 어딘가에서 에이전트 여러분께 알려드리도록 하겠습니다!`,
  },

  {
    id: "3",
    category: "NOTICE",
    title: "웹사이트 개편 안내",
    date: "2026-08-25",
    content: `- 메뉴 및 각종 내용 추가`,
  },

  {
    id: "2",
    category: "NOTICE",
    title: "웹사이트 개편 안내",
    date: "2026-08-14",
    content: `- 웹사이트 구조 변경, 조직도 및 서비스 추가`,
  },

  {
    id: "1",
    category: "NOTICE",
    title: "웹사이트 개편 및 채용 게시판 오픈",
    date: "2026-05-30",
    content: `- 공지사항 및 채용 게시판이 추가되었습니다.`,
  },
  
];

export default noticeBoard;
