import { BoardItem } from "../components/Board/types";

const recruitBoard: BoardItem[] = [
  {
    id: "KR-NEWB-2026-001",
    category: "장기/단기",
    title: "Customer Service Manager",
    date: "~2026-06-19",
    applyLink: "https://forms.gle/i1fauNj2pxVjPZK28",
    content: `

- (주)아이리스랩에서 운영하는 C2C 생활 플랫폼 '틈틈'의 고객지원을 위한 CS Manager를 채용합니다.

### 근무 조건
- 시급 11,000원 (주휴/야간/공휴일 등 수당 별도 지급)
- 재택근무
- 평일(월~금) 오후 1시 ~ 10시 중 시프트 제도로 유연 근무
주 8시간 ~ 40시간 근무 (요일 및 시간 협의 가능)

### 모집 인원
- 0 ~ 3명
- 행정 업무 진척도 및 사업 관련 인/허가 등 상황에 따라 인원을 모집하지 않을 수 있음.
    
### 역할
- 고객 응대 프로세스 및 매뉴얼 구축
- 결제·환불 데이터 관리 및 정산 업무
- CS 운영 지표 관리 및 상담 퀄리티 컨트롤
- VOC 분석을 통한 서비스 개선 제안
- 이슈 관리 및 에스컬레이션 대응
- 기타 CS 관련 제반 업무


### 자격요건
- 만 19세 이상 내국인
- 학력 / 경력 무관

### 채용 절차
- 서류 접수 (~ 6/19)
- 면접 (~ 6/21)
- 최종 합격자 발표 (~ 6/22)

### 참고사항
- 본 공고는 (주)아이리스랩의 업무대행을 위한 프리랜서 채용이 아닌, 근로기준법상 근로자 채용 공고입니다. 따라서 하기 사항에 동의하지 않는 경우, 채용 절차 진행이 불가능합니다.
- 산업재해보상보험법 제6조에 따라, 초단시간(주 15시간 미만 근무) 근로자를 포함한 모든 근로자는 산재보험에 의무적으로 가입해야 합니다.
- 고용보험법 시행령 제3조에 따라, 초단시간 근로자의 경우에도 3개월 이상 근무 시 고용보험에 의무적으로 가입해야 합니다.
- 초단시간 근로자가 아닌 경우, 4대보험(고용보험, 건강보험, 국민연금, 산재보험) 의무 가입자에 해당합니다.
`,
  },
];

export default recruitBoard;
